{"basics":{"name":"Beechui (Katy) Koo","label":"Data Scientist / AI Engineer | Research Associate","image":"","email":"koobcbc@gmail.com","phone":"(617) 888-0042","url":"","summary":"MS in Applied Data Science student at the University of Chicago with a strong background in machine learning and biology. Currently working as a Research Associate in Radiation and Cellular Oncology at UChicago Medicine and as a Data Scientist/AI Engineer at Oncosoft Inc.","location":{"address":"","postalCode":"","city":"Chicago","countryCode":"US","region":"Illinois"},"profiles":[{"network":"GitHub","username":"koobcbc","url":"https://github.com/koobcbc"},{"network":"LinkedIn","username":"katybkoo","url":"https://linkedin.com/in/katybkoo"}]},"work":[{"name":"Sohn Lab, Dept. of Radiation and Cellular Oncology, University of Chicago","position":"Research Associate / Project Lead","url":"","startDate":"2025-03-01","endDate":"","summary":"Led independent research projects on quantitative comparison of CT metal artifact reduction algorithms and TOPAS Monte Carlo simulations with cutting-edge nanomaterial applications.","highlights":["Led independent research projects on \"Quantitative Comparison of CT Metal Artifact Reduction (MAR) Algorithms in Radiation Oncology\" and \"TOPAS Monte Carlo Simulations with Cutting-Edge Nanomaterial Applications to Optimize Shielding Designs for Modern Radiation Therapy Facilities\"","Directly managed a team of interns and junior researchers through weekly meetings, milestone planning, and technical lectures on applied medical physics and computational modeling","Established project roadmaps and analysis pipelines, including custom evaluation metrics (e.g., HU error maps, M-Error Index) and artifact quantification methods","Served as the primary liaison between the research team and faculty advisor, ensuring scientific alignment, resource coordination, and progress reporting"]},{"name":"Oncosoft Inc.","position":"Data Scientist / AI Engineer","url":"","startDate":"2025-06-01","endDate":"","summary":"Designed and integrated AI-powered clinical solutions for radiation therapy, contributing to a 200% increase in annual revenue.","highlights":["Designed and integrated an AI-powered clinical chatbot leveraging Retrieval-Augmented Generation (RAG) and specialized agents to provide real-time, context-aware responses by querying graph databases, LLMs (GPT-4), and external medical knowledge sources, contributing to a 200% increase in annual revenue by streamlining patient information access","Developed a full-stack clinical software platform using React.js and Django, enabling clinicians to view dashboards, analyze patient charts, create custom forms, and manage records efficiently for radiation therapy","Represented the platform at professional conferences, demonstrating features and engaging with potential users and stakeholders"]},{"name":"Xsphera Biosciences Inc.","position":"Software Engineer","url":"","startDate":"2021-09-01","endDate":"2024-07-01","summary":"Developed cloud-based platforms and data pipelines for immuno-oncology analysis, reducing validation time by 10x.","highlights":["Developed an end-to-end multi-omics data pipeline for immuno-oncology analysis, integrating Python ML frameworks with MySQL and AWS S3 to automate ingestion, preprocessing, and quality-controlled analysis","Led the development of a cloud-based single-cell flow cytometry analysis platform built with Django and React.js, integrating ML classifiers for immune cell population profiling and deploying scalable data processing pipelines using AWS EC2","Replaced manual Excel-based plotting by building interactive dashboards with Plotly Dash, custom JavaScript callbacks, and Django back-end, reducing result-check steps and centralizing insights, directly reducing validation time by 10x"]},{"name":"Hur Lab, Harvard Medical School, Boston Children's Hospital","position":"Research Assistant","url":"","startDate":"2019-05-01","endDate":"2020-05-01","summary":"Contributed to research investigating innate immune responses to viral infection, with a focus on the RIG-I/MAVS signaling pathway.","highlights":["Contributed to research investigating innate immune responses to viral infection, with a focus on the RIG-I/MAVS signaling pathway and downstream cellular mechanisms","Assisted in experimental design, execution, and data interpretation for molecular and cell biology studies aimed at elucidating antiviral defense mechanisms","Performed core laboratory techniques including molecular cloning, mammalian cell culture and transfection, SDS-PAGE, western blotting, cDNA synthesis, and fluorescence microscopy"]}],"volunteer":[],"education":[{"institution":"University of Chicago","location":"Chicago, IL","url":"https://www.uchicago.edu/","area":"Applied Data Science","studyType":"M.S.","startDate":"2024-09-01","endDate":"2025-12-01","score":"3.98/4.00","courses":["Data Engineering","Statistical Models for Data Science","Machine Learning I/II","Bayesian Machine Learning with GenAI Applications","Time Series Analysis and Forecasting","Leadership and Consulting","Computer Vision","GenAI Principles & Applications","Capstone I/II"]},{"institution":"Boston College","location":"Brighton, MA","url":"","area":"Computer Science, Minor in Biology","studyType":"B.S.","startDate":"2017-08-01","endDate":"2021-05-01","score":"","courses":["General Chemistry I/II","Organic Chemistry I/II","Cell Biology","Genomics","Computer Science I/II","Algorithms","Object-Oriented Design","Computer Systems","Intro to Physics I (Calc) w/ Lab","Multivariable Calculus","AP Physics B1/B2/C Equivalent"]},{"institution":"University of California San Diego","location":"Online","url":"","area":"Physics Extended Courses","studyType":"Accredited Courses","startDate":"2025-06-01","endDate":"2025-08-31","score":"","courses":["Mechanics and Thermodynamics","Electricity and Magnetism","Modern Physics"]}],"awards":[{"title":"Korean Honor Scholarship","date":"2025-08-01","awarder":"Embassy of Republic of Korea in the USA","url":"","summary":""},{"title":"United Airlines GenAI Hackathon 2nd Place","date":"2025-06-01","awarder":"United Airlines","url":"","summary":""},{"title":"The University of Chicago Data Science Institute Merit Scholarship","date":"2024-08-01","awarder":"University of Chicago","url":"","summary":""}],"certificates":[{"name":"MIT Data Science & Machine Learning 12-week Certificate","date":"2025-05-01","issuer":"MIT-Schwarzman College of Computing","url":"","icon":"fa-solid fa-certificate"},{"name":"General Assembly Software Engineering 14-week Immersive Course Certificate","date":"2020-08-01","issuer":"General Assembly","url":"","icon":"fa-solid fa-certificate"}],"publications":[],"skills":[{"name":"Programming","level":"Expert","keywords":["Python","R","Django","React.js","Ruby on Rails","SQL (MySQL, PostgreSQL)","NoSQL (MongoDB/Mongoose)"]},{"name":"AI & Machine Learning","level":"Expert","keywords":["Generative AI (LLMs, RAG, LangChain)","PyTorch","TensorFlow","Keras","Scikit-learn","Computer Vision","QLoRA"]},{"name":"Cloud & DevOps","level":"Advanced","keywords":["AWS","GCP"]},{"name":"Data Science & Analytics","level":"Expert","keywords":["Data Pipelines (cleaning, wrangling, visualization, modeling, interpretation)","Statistical Analysis","Hypothesis Testing","Tableau","Pandas","OpenCV"]},{"name":"Monte-Carlo simulation","level":"Advanced","keywords":["TOPAS"]},{"name":"CAD/Modeling Software/3D Printing","level":"Advanced","keywords":["AutoCAD","Fusion 360","Rhino","Bambu Studio","Makerspace","3D printing"]}],"languages":[{"language":"English","fluency":"Fluent"},{"language":"Korean","fluency":"Native"}],"interests":[],"references":[{"name":"James J. Sohn, PhD.","reference":"Assistant Professor, Dept. of Radiation and Cellular Oncology, The University of Chicago, Chicago, IL 60637. Email: Jooyoung.sohn@bsd.uchicago.edu"},{"name":"Jason W. Sohn, PhD.","reference":"Director of Medical Physics, Dept. of Radiation Oncology, Beth Israel Deaconess Medical Center, Boston, MA 02215. Email: jsohn3@bidmc.harvard.edu"},{"name":"Sun Hur, PhD.","reference":"Oscar M. Schloss, MD Professor of Pediatrics, Dept. of Biological Chemistry and Molecular Pharmacology, Harvard Medical School, Boston, MA 02115. Email: sun.hur@crystal.harvard.edu"},{"name":"Utku Pamuksuz, PhD.","reference":"Assistant Clinical Professor, Data Science Institute, The University of Chicago, Chicago, IL 60637. Email: pamuksuz@uchicago.edu"},{"name":"Nick Kadochnikov","reference":"Assistant Clinical Professor, Data Science Institute, The University of Chicago, Chicago, IL 60637. Email: kadochnikov@uchicago.edu"}],"projects":[{"name":"Research Associate - Sohn Lab","summary":"Led research projects on CT metal artifact reduction algorithms and TOPAS Monte Carlo simulations","highlights":["Performed quantitative evaluation and benchmarking of commercial CT metal artifact reduction (MAR) algorithms in a radiation oncology context","Developed TOPAS Monte Carlo simulations incorporating advanced nanomaterials to optimize shielding designs for next-generation radiation therapy vaults","Simulated the dosimetric impact of tattoos on skin during radiation therapy using TOPAS-based Monte Carlo methods","Designed and implemented an automated pipeline for generating variable-thickness 3D printed molds tailored for conformal surface brachytherapy"],"startDate":"2025-03-01","endDate":"","url":""},{"name":"Capstone Partner AI / Software Engineer","summary":"AI-driven diagnostic assistant for skin and dental photo analysis","highlights":["Designed and implemented an AI-driven diagnostic assistant that analyzes user-uploaded skin or dental photos to identify potential diseases","Integrated CNN-based computer vision models with Gemini 2.5 LLM to provide explainable condition summaries and recommend next steps using verified medical sources","Developed a cross-platform mobile application using React Native (Expo Go), with backend integration into Firestore database, Google BigQuery, and Vertex AI for scalable data storage and inference"],"startDate":"2025-02-01","endDate":"","url":""},{"name":"United Airlines GenAI Hackathon Project","summary":"Agent-to-agent GenAI solution for real-time airline fault reporting (2nd Place Winner)","highlights":["Led the development of an agent-to-agent GenAI solution for real-time airline fault reporting, awarded 2nd place in UA GenAI hackathon","Architected a modular multi-agent system using LangChain and Gemini to handle multimodal inputs and automate issue triage","Integrated specialized AI agents (Image, Form, Submission, Supervisor) to classify images, auto-fill structured forms, and execute RAG-driven fault resolution pipelines"],"startDate":"2025-02-01","endDate":"2025-03-01","url":""},{"name":"Machine Learning Projects","summary":"Various ML projects including BMI prediction, echocardiogram analysis, and stock price prediction","highlights":["Built a machine-learning pipeline to predict BMI from images by benchmarking CNN-based models, and deploy the best model in a live smartphone app","Developed an end-to-end deep-learning pipeline that estimates left-ventricular ejection fraction from echocardiogram videos on public echo datasets","Built a stock price prediction model by performing sentiment classification on financial news headlines using a BERT-based NLP pipeline, and integrated results into an LSTM model to forecast stock price movements"],"startDate":"2024-11-01","endDate":"2025-05-01","url":""}]}